In [ ]:
# Lab | SQL Queries 9

#Instructions
#In this lab we will find the customers who were active in consecutive months of May and June. 
#Follow the steps to complete the analysis.

In [60]:
#Respuestas 1-6 se encuentran en la siguiente liga de 
#MySQL: https://github.com/jcarsu/SQL-Acts-Labs/blob/main/Lab%206.sql

In [1]:
#7. Create a Python connection with SQL database and retrieve the 
    #results of the last two queries (also mentioned below) as dataframes:

	#Check the number of rentals for each customer for May
    #Check the number of rentals for each customer for June
    
    #Hint: You can store the results from the two queries in two separate dataframes.

In [25]:
from sqlalchemy import create_engine
import pandas as pd
import getpass
import pymysql

In [26]:
password=getpass.getpass()

 ········

In [27]:
connection_string='mysql+pymysql://root:'+password+'@localhost/sakila'
engine=create_engine(connection_string)

In [28]:
query='select rental_date, customer_id, COUNT(*) as rentals \
from rentals_may \
group by customer_id \
order by COUNT(*) DESC'
data_rentalsm=pd.read_sql_query(query,engine)
data_rentalsm.head()

          rental_date  customer_id  rentals
0 2005-05-25 16:03:42          197        8
1 2005-05-25 19:12:42          506        7
2 2005-05-26 07:27:57          109        7
3 2005-05-24 23:11:53          269        6
4 2005-05-24 23:31:46          239        6

In [35]:
type(data_rentalsm)

pandas.core.frame.DataFrame

In [19]:
query='select rental_date, customer_id, COUNT(*) as rentals \
from rentals_june \
group by customer_id \
order by COUNT(*) DESC'
data_rentalsj=pd.read_sql_query(query,engine)
data_rentalsj.head()

          rental_date  customer_id  rentals
0 2005-06-16 10:05:40           31       11
1 2005-06-16 09:14:58          454       10
2 2005-06-15 00:49:19          329        9
3 2005-06-15 00:49:36          295        9
4 2005-06-15 01:24:20          561        9

In [34]:
type(data_rentalsj)

pandas.core.frame.DataFrame

In [ ]:
#8. Write a function that checks if customer borrowed more or less 
    #films in the month of June as compared to May.
	#Hint: For this part, you can create a join between the two dataframes created before, 
    #using the merge function available for pandas dataframes. 
    #Here is a link to the documentation for the merge function.

In [59]:
result = pd.merge(data_rentalsm, data_rentalsj, how='inner', on="customer_id",
                 suffixes=('_may', '_june'))
result

,rental_date_may,customer_id,rentals_may,rental_date_june,rentals_june
0,2005-05-25 16:03:42,197,8,2005-06-15 00:15:15,8
1,2005-05-25 19:12:42,506,7,2005-06-15 19:13:45,5
2,2005-05-26 07:27:57,109,7,2005-06-16 04:28:45,5
3,2005-05-24 23:11:53,269,6,2005-06-15 11:43:09,3
4,2005-05-24 23:31:46,239,6,2005-06-14 23:00:34,5
...,...,...,...,...,...
507,2005-05-31 17:23:44,234,1,2005-06-15 05:09:01,8
508,2005-05-31 17:27:45,431,1,2005-06-16 02:41:30,7
509,2005-05-31 19:20:14,351,1,2005-06-16 20:04:50,3
510,2005-05-31 19:36:30,10,1,2005-06-16 20:21:53,5
511,2005-05-31 21:20:09,136,1,2005-06-17 19:14:30,1